notes/meeting_2022may22.org
* meeting notes May 22, 2022
** the raku study group
*** usual links
**** these notes
***** https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022may22.md
**** code examples
***** https://github.com/doomvox/raku-study/tree/main/bin/2022may22
** topics
*** move/copy etc, larry wall, apocaylpse, etc.  more to come.
*** defined sigma operator experiments
**** controlling precedence of custom operators
**** broken link in here: https://docs.raku.org/language/operators


*** TODO add new stuff and raid last meeting for ideas
*** define a sigma operator for summation
**** https://docs.raku.org/language/optut

** announcements 
*** June 5th: next raku study group meeting 
*** June 21-25: tprc: perl/raku conference 
**** 4 hours of Bruce Gray: talk + 3hr tutorial
***** https://tprc2022.sched.com/event/ylEK/command-line-filters-time-to-shine
***** https://tprc2022.sched.com/overview/type/Raku+Track




