notes/meeting_2022may22.md
- [meeting notes May 22, 2022](#org4231cc2)
  - [the raku study group](#org5513e93)
    - [usual links](#orgee8455c)
  - [topics](#org701b329)
    - [move/copy etc, larry wall, apocaylpse, etc.  more to come.](#org774c7aa)
    - [defined sigma operator experiments](#org68aaaf5)
    - [add new stuff and raid last meeting for ideas](#org0e3453e)
    - [define a sigma operator for summation](#org192407f)
  - [announcements](#orgacfd714)
    - [June 5th: next raku study group meeting](#orgbfc77c5)
    - [June 21-25: tprc: perl/raku conference](#org806ded2)


<a id="org4231cc2"></a>

# meeting notes May 22, 2022


<a id="org5513e93"></a>

## the raku study group


<a id="orgee8455c"></a>

### usual links

1.  these notes

    1.  <https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022may22.md>

2.  code examples

    1.  <https://github.com/doomvox/raku-study/tree/main/bin/2022may22>


<a id="org701b329"></a>

## topics


<a id="org774c7aa"></a>

### move/copy etc, larry wall, apocaylpse, etc.  more to come.


<a id="org68aaaf5"></a>

### defined sigma operator experiments

1.  controlling precedence of custom operators

2.  broken link in here: <https://docs.raku.org/language/operators>


<a id="org0e3453e"></a>

### TODO add new stuff and raid last meeting for ideas


<a id="org192407f"></a>

### define a sigma operator for summation

1.  <https://docs.raku.org/language/optut>


<a id="orgacfd714"></a>

## announcements


<a id="orgbfc77c5"></a>

### June 5th: next raku study group meeting


<a id="org806ded2"></a>

### June 21-25: tprc: perl/raku conference

1.  4 hours of Bruce Gray: talk + 3hr tutorial

    1.  <https://tprc2022.sched.com/event/ylEK/command-line-filters-time-to-shine>
    
    2.  <https://tprc2022.sched.com/overview/type/Raku+Track>
